; domain
; This is a new custom planner for a pick and place task

(define (domain tabletop-skill)
  (:requirements :strips :typing)
  (:types block)
  (:predicates
    (block ?b)                         ; ?b is a block
    (top-clear ?b)                     ; block ?b does not have anything blocking access from above
    (on-block ?b1 ?b2)                 ; block ?b1 is on top of block ?b2
    (arm-free)                         ; the robot arm is free and not holding anything
    (holding ?b)                       ; arm is currently holding block ?b.
    (red ?b)                           
    (blue ?b)                          
    (green ?b)                         
  )

  ;; PICK: picks up a block.
  (:action pick
    :parameters (?b - block)
    :precondition (and (top-clear ?b) (arm-free))
    :effect (and (holding ?b)
                 (not (arm-free)))
  )



  ;; STACK: places a block on top of another block.
  (:action stack
    :parameters (?b1 - block ?b2 - block)
    :precondition (and (holding ?b1)
                       (top-clear ?b2))
    :effect (and (on-block ?b1 ?b2)
                 (not (top-clear ?b2))
                 (arm-free)
                 (not (holding ?b1)))
  )
)

; problem
(define (problem skill-put-blocks-bin)
  (:domain tabletop-skill)
  (:objects
    red blue green - block   ; The three colored blocks.
  )
  (:init
    (arm-free)                    ; declarations
    (top-clear red)               ; Red block is initially on table
    (top-clear blue)              ; Blue block is initially on table
    (top-clear green)             ; Green block is initially on table
    (red red)
    (blue blue)                   
    (green green)                 
  )
  (:goal (and
           (on-block red green)      ; Red block must be in bin
           (on-block green blue)    ; Blue block must be in bin
  ))
)

; plan
1. (pick green)
   deleted: (arm-free)
   added: (holding green)
   goals met: 0 of 2
2. (stack green blue)
   deleted: (top-clear blue) (holding green)
   added: (on-block green blue) (arm-free)
   goals met: 1 of 2
3. (pick red)
   deleted: (arm-free)
   added: (holding red)
   goals met: 1 of 2
4. (stack red green)
   deleted: (top-clear green) (holding red)
   added: (on-block red green) (arm-free)
   goals met: 2 of 2
